{
    "catalog": [
        {"id":"1", "brand":"BMW", "model":"3-series", "shape":"Седан/Универсал", "fuel":"Бензин/Дизель", "image":"https://images.drive.ru/i/0/5bb32379ec05c4b15400001e.jpg", "price": 2500000, "info": "Седьмое поколение легковых автомобилей 3-й серии немецкого автоконцерна BMW, которые поступили в продажу весной 2019 года. Внешний вид седана с чёткими линиями и рельефными поверхностями демонстрирует современный, динамичный характер моделей нового поколения. Автомобиль стал больше: длиннее и шире, увеличилась его колёсная база. Коэффициент аэродинамического сопротивления удалось снизить до 0,23. Достигнуто это, в том числе, за счёт полностью закрытого аэродинамическими щитками днища, специальной формы обтекаемых колёс и воздушных направляющих в передней части автомобиля. Общая жёсткость кузова возросла на 25%, а в некоторых зонах — вдвое. При этом он стал весить меньше, за счёт разумного сочетания деталей из высокопрочной стали и алюминия. Так, алюминиевыми стали капот, передние брызговики и подрамник. В результате масса «голого» кузова снизилась на 20 килограммов, а вес всего автомобиля, в определённых комплектациях, стал до 55 килограммов меньше.", "year": "2018-2023", "mass":"1455 кг", "country":"Германия", "class":"D"},
        {"id":"2","brand":"Mercedes", "model":"C-class", "shape":"Седан/Универсал/Купе/Кабриолет", "fuel":"Бензин/Дизель", "image":"https://www.major-auto.ru/cars_images/1364484/2D/medium/1364484_1_2855712_14512648.JPG", "price": 3000000, "info":"Mercedes-Benz C-класс — серия компактных представительских автомобилей немецкой автомобилестроительной компании Mercedes-Benz, дебютировавшая в 1993 году. Является развитием модели Mercedes-Benz 190. До появления A-класса в 1997 году серия представляла собой наименьшие автомобили как по габаритам, так и по классификации в иерархии марки Mercedes-Benz. C-класс включает в себя четыре поколения: W202, представленный в 1992 году, W203, сошедший с конвейера 18 июля 2000 года, W204, выпускавшегося с 2007 года и W205, дебютировавшего в 2014 году и производящегося до настоящего времени. Изначально автомобили C-класса выпускались только в кузовах седан и универсал, однако начиная со 2-го поколения к ним прибавилось спорт-купе, которое впоследствии после проведения рестайлинга преобразовалось в отдельный CLC-класс. Позже, начиная с Mercedes-Benz W204, в линейку кузовов добавилось купе, а с приходом 5-о поколения в лице W205 её пополнил и кабриолет. Как и многие иные модели торговой марки Mercedes-Benz автомобили C-класса имеют высокопроизводительные модификации от подразделения Mercedes-AMG. Кроме того, в рамках второго поколения была представлена единственная в истории фирмы высокопроизводительная модель с дизельным силовым агрегатом — C30 CDI AMG. Автомобили C-класса сходят (или сходили) с конвейеров заводов в Зиндельфингене и Бремене (Германия), а также в Ист-Лондоне (ЮАР).", "year":"2021-2023", "mass":"1625 кг", "country":"Германия", "class":"D"},
        {"id":"3","brand":"Audi", "model":"A4", "shape":"Седан/Универсал", "fuel":"Бензин/Дизель", "image":"https://audi-rus.ru/img/news/audi-a4-new-2019-6.jpg", "price": 2800000, "info":"Audi A4 (B9) — пятое поколение среднеразмерного Audi A4. Первые официальные снимки четвёртого поколения появились ещё 29 июня 2015 года, а в сентябре 2015 года на Международном автомобильном салоне состоялась премьера автомобиля. Модель оснащалась тремя бензиновыми и четырьмя дизельными двигателями внутреннего сгорания. Мощность двигателей варьируется от 150 до 272 л. с. В отличие от Audi A4 (B8), расход топлива снижен на 21%. Мощность двигателей увеличена на 25%. Двигатели соответствуют стандарту Евро-6. Система «старт-стоп» глушит двигатель при торможении со скоростью менее 7 км/ч.", "year":"2019-2023", "mass":"1500 кг", "country":"Германия", "class":"D"},
        {"id":"4","brand":"Jaguar", "model":"XF", "shape":"Седан", "fuel":"Бензин/Дизель", "image":"https://s.auto.drom.ru/i24201/c/photos/fullsize/jaguar/xe/jaguar_xe_624424.jpg", "price": 3200000, "info":"Jaguar XF — люксовый седан бизнес-класса/ спортивный седан, выпускаемый британской автомобилестроительной компанией Jaguar с 2008 года. Является преемником Jaguar S-type. XF был впервые представлен в 2007 на Франкфуртском автосалоне. XF был разработан дизайнерском и конструкторском отделении Jaguar в Уитли (Ковентри, Великобритания) и производится на заводе в Касл Бромвич (Бирмингем, Великобритания). Первые поставки покупателям начались в марте 2008 года.", "year":"2015-2023", "mass":"1785 кг", "country":"Великобритания", "class":"E"},
        {"id":"5","brand":"Porsche", "model":"Macan", "shape":"Кроссовер", "fuel":"Бензин/Дизель", "image":"https://s1.1zoom.ru/big0/705/Porsche_Macan_Turbo_2014_Black_Front_Asphalt_595479_1280x704.jpg", "price": 4000000, "info":"Для Porsche Macan предусматриваются несколько вариантов двигателя, в частности, два бензиновых би-турбо-мотора объёмом 3,0 л и 3,6 л мощностью соответственно 340 и 400 л. с., а также дизельный двигатель объёмом 3,0 л мощностью 258 л. с. Porsche Macan c 3,0 л бензиновым и 3,0 л дизельным двигателями получил название Macan S, а с двигателем 3,6 л — Macan Turbo. На рынки некоторых стран поставляется версия Diesel S с 245-сильным дизельным двигателем от Cayenne без системы SCR. Коробка передач — 7-ступенчатая полуавтоматическая трансмиссия PDK. Запланирован выпуск Macan с механической КПП. На территорию Российской Федерации официально поставляются пока только бензиновые модификации: Macan S и Macan Turbo. На 2014 год для России изначально была установлена квота в размере 1000 машин в год, сейчас квоту увеличили до 1500 машин в год. В декабре 2015 года в России поступят в продажу Porsche Macan S с дизельным двигателем.", "year":"2014-2023", "mass":"1845 кг", "country":"Германия", "class":"D"},
        {"id":"6","brand":"Tesla", "model":"Model S", "shape":"Лифтбек", "fuel":"Электро", "image":"https://www.autostat.ru/application/includes/blocks/big_photo/images/cache/000/093/519/d7c99968-670-0.jpg", "price": 3800000, "info":"Производство Tesla Model S началось с ограниченного выпуска 1000 седанов Signature и Signature Performance стоимостью 95 400 и 105 400 долларов соответственно и оснащённых аккумуляторами ёмкостью 85 кВт•ч. Изначально Tesla планировала начать в 2013 году производство электромобилей с аккумуляторами ёмкостью 60 кВт·ч (335 км) и 40 кВт·ч (260 км), однако из-за низкого спроса на маломощную модель 40 кВт·ч решено было отказаться от них. В июне 2013 года компания показала перезарядку Model S путём автоматической замены батареи аккумуляторов. Процедура занимает примерно 90 секунд, что более чем вдвое быстрее заправки топливного бака автомобиля подобного класса. По заявлению президента компании Илона Маска, «медленная» (20 минут для 50 % заряда аккумулятора) зарядка батареи Model S на заправочных станциях компании останется бесплатной, в то время как быстрая замена обойдётся владельцу машины в сумму около 60—80 долларов, что примерно соответствует стоимости полного бака бензина. Однако, в дальнейшем, от планов по автоматической смене батарей было решено отказаться в пользу развития сети заправок Tesla Superchargers. Только автомобили, проданные до 22 января 2017 года, будут пользоваться пожизненной бесплатной неограниченной быстрой зарядкой на станциях Tesla Superchargers; автомобили, проданные после января 2017 года, получат 400 кВт·ч бесплатной быстрой зарядки в год, при превышении этого количества, владельцу придётся оплатить стоимость потреблённого во время быстрой зарядки электричества. В 2016 году Tesla Model S получил обновлённый дизайн, частично более схожий с Model 3. В 2017 году также произошло некоторое обновление модельного ряда и теперь в продаже доступны только версии 75, 75D, 100D, P100D (цифры обозначают ёмкость аккумулятора в кВт·ч, D — полный привод, P — производительная версия).", "year":"2012-2023", "mass":"2069 кг", "country":"США", "class":"F"},
        {"id":"7","brand":"Ford", "model":"Mustang", "shape":"Купе", "fuel":"Бензин", "image":"https://quto.ru/imgs/2020/10/21/18/4278494/7705644efe7102cbb1ee2d7d6adbe619cea9c87c.jpg", "price": 4500000, "info":"Ford Mustang — культовый автомобиль класса Pony Car производства Ford Motor Company. На автомобиле размещается не эмблема Ford, а специальная эмблема Mustang. Изначальный вариант (1964/65—1973 гг.) был создан на базе агрегатов семейного седана Ford Falcon (создатель Ли Якокка и его команда). Первый серийный Mustang сошёл с конвейера 9 марта 1964 года как модель 1965 года (в среде коллекционеров относительно Mustang выпуска до осени 1964 года употребляется неофициальное обозначение «модель 1964 1/2»). 17 апреля автомобиль был представлен публике в Нью-Йорке, а 19 апреля — показан по всем трём американским телевещательным сетям. Продвижение автомобиля сопровождалось активной рекламной кампанией. Это была одна из самых удачных премьер в истории автомобилестроения.", "year":"2014-2023", "mass":"1653 кг", "country":"США", "class":"S"},
        {"id":"8","brand":"Alfa Romeo", "model":"Gulia", "shape":"Седан", "fuel":"Бензин/Дизель", "image":"https://wallpapershome.ru/images/wallpapers/alfa-romeo-2560x1440-krasniy-7353.jpg", "price": 2900000, "info":"Alfa Romeo Giulia (Серия 952) - престижный автомобиль среднего класса, выпускающийся компанией Alfa Romeo с февраля 2016 года. Данная модель заменила Alfa Romeo 159. Автомобиль был представлен 24 июня 2015 года, на 105-летие компании Alfa Romeo. Запуск Giulia уже откладывался несколько раз. По имеющимся сообщениям дизайн автомобиля несколько раз возвращался на чертёжную доску по приказу исполнительного директора Fiat Серджио Маркионне.", "year":"2015-2023", "mass":"1374 кг", "country":"Италия", "class":"D"},
        {"id":"9","brand":"Chevrolet", "model":"Camaro", "shape":"Купе", "fuel":"Бензин", "image":"https://avatars.mds.yandex.net/get-verba/3587101/2a00000180506a368e2d73f3bca06a65d836/auto_main", "price": 4500000, "info":"Chevrolet Camaro — американский маслкар, выпускающийся подразделением Chevrolet корпорации General Motors с 1966 года. Производство было прекращено в 2002 году и возобновлено на новой технической базе в 2009 году. 16 мая 2015 года в Детройтском Бель-Иль парке (англ. Belle Isle Park) состоялся первый официальный показ модели шестого поколения. Во время церемонии была организована выставка 25 лучших серийных, концептуальных и гоночных Camaro предыдущих поколений из запасников GM и частных коллекций. В конце октября первые Camaro начали сходить с конвейера, а в середине ноября они поступили в продажу в США как автомобили 2016 модельного года. В России модель нового поколения была представлена летом 2016 года. Автомобиль создан на новой корпоративной платформе Alpha, но у Camaro более 70 % деталей новые, включая полностью новый интерьер, новые переднюю и заднюю подвески и силовой привод. Он стал немного меньше и легче, но сохранил все узнаваемые черты.", "year":"2015-2023", "mass":"1566 кг", "country":"США", "class":"S"}
    ]
}